Question: 1

In [ ]:
SELECT * FROM runners WHERE id NOT IN (SELECT winner_id FROM races);
Is something like this (actual values from races):

SELECT * FROM runners WHERE
id <> 2 and
id <> 3 and
id <> null;
id <> null is unknown by definition, so the whole where clause evaluates to either false (for ids: 2, 3) or unknown (for ids: 1, 4, 5) because of the and operators, thus no result returned.

If you want to run the query disregarding the nulls in races, you can use:

SELECT * FROM runners 
WHERE id NOT IN 
      (SELECT winner_id FROM races WHERE winner_id IS NOT NULL);

Question: 2

In [ ]:
select * from test_a
except
select * from test_b;

In [ ]:
Select id.* from test_a
Left join test_b on (test_a.id = test_b.id) where test_b.id is null

In [ ]:
Question: 3

In [ ]:
SELECT * FROM runners WHERE id NOT IN (SELECT winner_id FROM races)

In [ ]:
SELECT * FROM runners WHERE id NOT IN (SELECT winner_id FROM races WHERE winner_id IS NOT null)

In [ ]:
Question:4

In [ ]:
INSERT INTO Customer (Emp_ID, Emp_name, Salary, Manager_Id)
VALUES (10, 'Anil', '50000', '18'),
       (11, 'Vikas ', '75000', '16'),
       (12, 'Nisha', '40000', '18'),
       (13, 'Nidhi', '60000', '17'),
       (14, 'Priya', '80000', '18'),
       (15, 'Mohit', '45000', '18'),
       (16, 'Rajesh', '90000', '-'),
       (17, 'Reman', '55000', '16'),
       (18, 'Santosh', '65000', '17');

In [ ]:
CREATE TABLE customer AS SELECT * FROM customer LIMIT 3;

In [ ]:
SELECT * FROM Customer
WHERE
ID > (Select COUNT(*) FROM Customer)-3;

In [ ]:
SELECT Rajesh,AVG(65000) as average_Salary_Under_Manager
FROM Customer
GROUP BY Salary;

In [ ]:
SELECT Raman, AVG(625000) as
FROM Customer 
GROUP BY Salary;

In [ ]:
SELECT Santosh, AVG(53)
FROM employee_tbl 
GROUP BY name;